<script setup>
import Rules from "./Rules.vue";
import RuleCard from "./RuleCard.vue";
import Tag from "./Tag.vue";
</script>

<template>
  <div class="content">

    <h2><Tag>mc 0</Tag> Общие правила</h2>

  <Rules>

    <RuleCard id="mc0.1" title='Оправдание "Я не знал"'>
      Незнание правил не освобождает от ответственности. </RuleCard>

    <RuleCard id="mc0.2" title="Бан за 5 предов" punish="Бан на 30 дней">
      При достижении пяти предупреждений (варнов) человеку выдаётся бан.
      <br>После этого преды сбрасываются. </RuleCard>

    <RuleCard id="mc0.3" title="Твинки запрещены" punish="Вечный бан твинка">
      Особенно когда они используются для обхода и нарушения правил.</RuleCard>

  </Rules>

    <h2><Tag>mc 1</Tag> Правила общения</h2>

  <Rules>

    <RuleCard id="mc1.1" title='Флуд, спам и капс под запретом' punish="Мут от 20 минут, возможен пред">
      Флудом считается повторение похожих сообщений 3+ раза. </RuleCard>

    <RuleCard id="mc1.2" title="Запрещена любая реклама" punish="Бан на 30 дней, возможен перманентный">
      Ссылки на дружественные проекты не считаются за нарушение.</RuleCard>

    <RuleCard id="mc1.3" title="Запрещены любые оскорбления" punish="Мут от 60 минут, возможен пред">
      За оскорбление родителей выдаётся мут от 2 дней.<br>
      Оскорбление мифов тоже считается.</RuleCard>

    <RuleCard id="mc1.4" title='Неакдекватное поведение запрещено'
              punish="Пред либо бан от двух недель, возможен перманентный">
    </RuleCard>

    <RuleCard id="mc1.5" title="Политические споры запрещены" punish="Мут от 24 часов + пред">
      За споры о ситуации между Россией и Украиной мут от недели.</RuleCard>

    <RuleCard id="mc1.6" title="Запрещено неадекватное поведение в голосовом чате" punish="Зависит от ситуации">
      Под неакдекватным поведением имеется в виду включение сомнительных или
      громких звуков в голосовом чате, большое кол-во матов и т.д.</RuleCard>

  </Rules>

    <h2><Tag>mc 2</Tag> Правила игры</h2>

  <Rules>

    <RuleCard id="mc2.1" title='Гриферство запрещено' punish="Бан от 7 дней">
      Нельзя ломать чужие постройки, убивать чужих мобов или вредить другим игрокам подобными способами.
      За массовое гриферство перманентный бан. </RuleCard>

    <RuleCard id="mc2.2" title="Запрещено строить лавакасты и подобные структуры" punish="Пред + снос лавакаста">
      Если они находятся далеко от спавна или точек /escape, правило не действует.</RuleCard>

    <RuleCard id="mc2.3" title="Запрещены любые лагмашины" punish="Бан от 30 дней + 1-2 преда">
      Под правило попадают любые постройки, создающие лаги.</RuleCard>

    <RuleCard id="mc2.4" title='Запрещены пакетные читы' punish="1-3 преда">
      Пакетными называют читы, которые меняют что-то не визуально. Например, к таким относятся Fly или Speed.
      К этому относятся и эксплоиты, кладущие сервер пакетами.</RuleCard>

    <RuleCard id="mc2.5" title="Запрещён багоюз" punish="Бан от 2 дней + 1-2 преда">
      Чем критичнее баг, тем жёстче наказание.</RuleCard>

    <RuleCard id="mc2.6" title="Запрещены сомнительные постройки" punish="Бан от 7 дней + 1 пред">
      К "сомнительным" относятся политические и 18+ постройки.</RuleCard>

  </Rules>
  </div>

</template>

<style scoped>

.content {
  display: flex;
  flex-direction: column;
  gap: 10px;
}

</style>